# Детали

shop = [
    ['каретка', 1200], ['шатун', 1000], ['седло', 300],
    ['педаль', 100], ['седло', 1500], ['рама', 1200],
    ['обод', 2000], ['шатун', 200], ['седло', 2700]
]

# Запрашиваем у пользователя название детали.
# По названию выводим количество деталей и общую их стоимость:

detail = input('Название детали: ')

count_detail = 0
count_cost = 0
for title in shop:
    if detail in title:
        count_detail += 1
        count_cost += title[1]

if count_detail > 0:
    print('Количество деталей:', count_detail, '\nОбщая стоимость:', count_cost)
else:
    print('Такой детали в магазине нет.')

