# Детали

shop = [
    ['каретка', 1200], ['шатун', 1000], ['седло', 300],
    ['педаль', 100], ['седло', 1500], ['рама', 1200],
    ['обод', 2000], ['шатун', 200], ['седло', 2700]
]

# Запрашиваем у пользователя название детали.
# По названию выводим количество деталей и общую их стоимость:

name = input('Название детали: ')

count_part = 0
count_cost = 0
for part in shop:
    if name in part:
        count_part += 1
        count_cost += part[1]

if count_part > 0:
    print('Количество деталей:', count_part, '\nОбщая стоимость:', count_cost)
else:
    print('Такой детали в магазине нет.')

